Arie001/cortex-m3-applications.temperaturecontrolui/USER/glcd_driver/GLCD__driver_LPC1700.c
	/* Adjust the Gamma Curve --------------------------------------------------*/
	wr_reg(0x30, 0x0006);
	wr_reg(0x31, 0x0101);
	wr_reg(0x32, 0x0003);
	wr_reg(0x35, 0x0106);
	wr_reg(0x36, 0x0B02);
	wr_reg(0x37, 0x0302);
	wr_reg(0x38, 0x0707);
	wr_reg(0x39, 0x0007);
	wr_reg(0x3C, 0x0600);
	wr_reg(0x3D, 0x020B);
	  
	/* Set GRAM area -----------------------------------------------------------*/
	wr_reg(0x50, 0x0000);                 /* Horizontal GRAM Start Address      */
	wr_reg(0x51, (HEIGHT-1));             /* Horizontal GRAM End   Address      */
	wr_reg(0x52, 0x0000);                 /* Vertical   GRAM Start Address      */
	wr_reg(0x53, (WIDTH-1));              /* Vertical   GRAM End   Address      */
	wr_reg(0x60, 0x2700);                 /* Gate Scan Line                     */
	wr_reg(0x61, 0x0001);                 /* NDL,VLE, REV                       */
	wr_reg(0x6A, 0x0000);                 /* Set scrolling line                 */
	
	/* Partial Display Control -------------------------------------------------*/
	wr_reg(0x80, 0x0000);
	wr_reg(0x81, 0x0000);
	wr_reg(0x82, 0x0000);
	wr_reg(0x83, 0x0000);
	wr_reg(0x84, 0x0000);
	wr_reg(0x85, 0x0000);
	
	/* Panel Control -----------------------------------------------------------*/
	wr_reg(0x90, 0x0010);
	wr_reg(0x92, 0x0000);
	wr_reg(0x93, 0x0003);
	wr_reg(0x95, 0x0110);
	wr_reg(0x97, 0x0000);
	wr_reg(0x98, 0x0000);
  }
  
  /* Set GRAM write direction and BGR = 1
     I/D=10 (Horizontal : increment, Vertical : increment)
     AM=1 (address is updated in vertical writing direction)                  */
  wr_reg(0x03, 0x1038);

  wr_reg(0x07, 0x0173);                 /* 262K color and display ON          */ 
  if(driverCode == 0x8989)		 //3.2" TFT LCD Module,DriverIC is SSD1289
  {
  	    wr_reg(0x0000,0x0001);    delay(5);  //打开晶振
    	wr_reg(0x0003,0xA8A4);    delay(5);   //0xA8A4
    	wr_reg(0x000C,0x0000);    delay(5);   
    	wr_reg(0x000D,0x080C);    delay(5);   
    	wr_reg(0x000E,0x2B00);    delay(5);   
    	wr_reg(0x001E,0x00B0);    delay(5);   
    	wr_reg(0x0001,0x2b3F);    delay(5);        //驱动输出控制320*240  0x6B3F  293f	2b3f 6b3f
    	wr_reg(0x0002,0x0600);    delay(5);
    	wr_reg(0x0010,0x0000);    delay(5);
    	wr_reg(0x0011,0x6078);    delay(5);        //0x4030           //定义数据格式  16位色  横屏 0x6058	   6078
    	wr_reg(0x0005,0x0000);    delay(5);
    	wr_reg(0x0006,0x0000);    delay(5);
    	wr_reg(0x0016,0xEF1C);    delay(5);
    	wr_reg(0x0017,0x0003);    delay(5);
    	wr_reg(0x0007,0x0233);    delay(5);        //0x0233       
    	wr_reg(0x000B,0x0000);    delay(5);
    	wr_reg(0x000F,0x0000);    delay(5);        //扫描开始地址
    	wr_reg(0x0041,0x0000);    delay(5);
    	wr_reg(0x0042,0x0000);    delay(5);
    	wr_reg(0x0048,0x0000);    delay(5);
    	wr_reg(0x0049,0x013F);    delay(5);
    	wr_reg(0x004A,0x0000);    delay(5);
    	wr_reg(0x004B,0x0000);    delay(5);
    	wr_reg(0x0044,0xEF00);    delay(5);
    	wr_reg(0x0045,0x0000);    delay(5);
    	wr_reg(0x0046,0x013F);    delay(5);
    	wr_reg(0x0030,0x0707);    delay(5);
    	wr_reg(0x0031,0x0204);    delay(5);
    	wr_reg(0x0032,0x0204);    delay(5);
    	wr_reg(0x0033,0x0502);    delay(5);
    	wr_reg(0x0034,0x0507);    delay(5);
    	wr_reg(0x0035,0x0204);    delay(5);
    	wr_reg(0x0036,0x0204);    delay(5);
    	wr_reg(0x0037,0x0502);    delay(5);
    	wr_reg(0x003A,0x0302);    delay(5);
    	wr_reg(0x003B,0x0302);    delay(5);
    	wr_reg(0x0023,0x0000);    delay(5);
    	wr_reg(0x0024,0x0000);    delay(5);
    	wr_reg(0x0025,0x8000);    delay(5);
    	wr_reg(0x004f,0);        //行首址0
    	wr_reg(0x004e,0);        //列首址0
  }
}


/*******************************************************************************
* Set draw window region to whole screen                                       *
*   Parameter:                                                                 *
*   Return:                                                                    *
*******************************************************************************/

void GLCD_WindowMax (void) {
  
  if(driverCode==0x8989)
  {
	wr_reg(0x44, 0);                      /* Horizontal GRAM Start Address      */
    wr_reg(0x44, 0 |((HEIGHT-1)<<8));     /* Horizontal GRAM End   Address (-1) */
    wr_reg(0x45, 0);                      /* Vertical   GRAM Start Address      */
    wr_reg(0x46, WIDTH-1);                /* Vertical   GRAM End   Address (-1) */
  }
  else
  {
  	wr_reg(0x50, 0);                      /* Horizontal GRAM Start Address      */
  	wr_reg(0x51, HEIGHT-1);               /* Horizontal GRAM End   Address (-1) */
  	wr_reg(0x52, 0);                      /* Vertical   GRAM Start Address      */
  	wr_reg(0x53, WIDTH-1);                /* Vertical   GRAM End   Address (-1) */
  }
}


/*******************************************************************************
* Draw a pixel in foreground color                                             *
*   Parameter:      x:        horizontal position                              *
*                   y:        vertical position                                *
*   Return:                                                                    *
*******************************************************************************/

void GLCD_PutPixel (unsigned int x, unsigned int y) {
  if(driverCode==0x8989)
  {
  	wr_reg(0x4e, y);
  	wr_reg(0x4f, WIDTH-1-x);
  }
  else
  {
  	wr_reg(0x20, y);
  	wr_reg(0x21, WIDTH-1-x);
  }
  LCD_CS(0)
  wr_cmd(0x22);
  wr_dat(TextColor);
  LCD_CS(1)
}


/*******************************************************************************
* Set foreground color                                                         *
*   Parameter:      color:    foreground color                                 *
*   Return:                                                                    *
*******************************************************************************/

